{
    "cards": [
        {
            "id": "1",
            "word": "Laconic",
            "meaning" : "Brief and to the point; Effectively cut short.",
            "example": "Jessica is so talkative that her sister thought the situation warrated conciseness and her being laconic."
        },
        {
            "id" : "2",
            "word": "Insipid",
            "meaning": "Lacking taste or flavor",
            "example": "Too much sugar makes this otherwise delightful fruit pie insipid."
        },
        {
            "id" : "3",
            "word": "Pragmatic",
            "meaning": "Concerned with practical matters",
            "example":"After five years of war, both sides have found pragmatic ways to make peace with one another, as the bloodshed has grown viscous and brutal."
        },
        {
            "id": "4",
            "word": "Iconoclast",
            "meaning": "someone who attacks cherished beliefs or institutions",
            "example": "He is often seen as a rebel, an iconoclast who follows his own rules."
        },
        {
            "id": "5",
            "word": "Arduous",
            "meaning": "involving or requiring strenuous effort; difficult and tiring.",
            "example": "In those days, a trip to the West was an arduous journey."
        },
        {
            "id": "6",
            "word": "Profligate",
            "meaning": "recklessly extravagant or wasteful in use of resources",
            "example": "Spending £13,000 on a handbag seems offensively profligate."
        },
        {
            "id": "7",
            "word": "Prosaic",
            "meaning": "without interest, imagination, and excitement; dull;",
            "example": "He asked if I'd got my black eye in a fight - I told him the prosaic truth that I'd banged my head on a door."
        },
        {
            "id": "8",
            "word": "Ameliorate",
            "meaning": "to make a bad or unpleasant situation better",
            "example": "Foreign aid is badly needed to ameliorate the effects of the drought."
        },
        {
            "id": "9",
            "word": "Obsequious",
            "meaning": "too eager to praise or obey someone; excessively obedient",
            "example": "She is embarrassingly obsequious to anyone in authority."
        },
        {
            "id": "10",
            "word": "Capricious",
            "meaning": "likely to change, or reacting to a sudden desire or new idea",
            "example": "The decision rejected the notion of an arbitrary and capricious power accruing to state securities commissioners."
        },
        {
            "id": "11",
            "word": "Fortuitous",
            "meaning": "happening by chance rather than intention; fortunate",
            "example": "The collapse of its rivals was a fortuitous opportunity for the company."
        },
        {
            "id": "12",
            "word": "Orthodox",
            "meaning": "conforming to all the traditional beliefs, and religious practices; acceptable",
            "example": "Orthodox strategies for socio-economic development in developing countries."
        },
        {
            "id": "13",
            "word": "Alacrity",
            "meaning": "lively and cheerful readiness; eagerness",
            "example": "I am sure that they will be accepted with alacrity, knowing my noble friend's expertise in such matters."
        },
        {
            "id": "14",
            "word": "Pellucid",
            "meaning": "very clear and shining; very clear in meaning and easy to understand",
            "example": "the pellucid light of a spring morning."
        },
        {
            "id": "15",
            "word": "Corroborate",
            "meaning": "confirm or give support to; add information to an idea",
            "example": "Recent research seems to corroborate the theory."
        },
        {
            "id": "16",
            "word": "Magnanimous",
            "meaning": "very kind and generous towards someone you have defeated; forgiving",
            "example": "The team's manager was magnanimous in victory, and praised the losing team."
        },
        {
            "id": "17",
            "word": "Scrupulous",
            "meaning": "diligent; thorough; honest; extremely careful",
            "example": "The nurse told him to be scrupulous about keeping the wound clean."
        },
        {
            "id": "18",
            "word": "Prolific",
            "meaning": "producing a great number or amount of something; fruitful",
            "example": "Harada has been prolific, releasing more than 70 singles."
        },
        {
            "id": "19",
            "word": "Dogmatic",
            "meaning": "opinionated; strongly expressing your beliefs as if they were facts;",
            "example": "If you are dogmatic, you are certain that you are right and that everyone else is wrong."
        },
        {
            "id": "20",
            "word": "Placate",
            "meaning": "to stop someone from feeling angry or hostile.",
            "example": "Outraged minority groups will not be placated by promises of future improvements."
        },
        {
            "id": "21",
            "word": "Mercurial",
            "meaning": "changing suddenly and often; temperamental",
            "example": "She was entertaining but unpredictable, with mercurial mood swings."
        },
        {
            "id": "22",
            "word": "Exacerbate",
            "meaning": "make something already bad, worse; infuriate;",
            "example": "This attack will exacerbate the already tense relations between the two communities."
        },
        {
            "id": "23",
            "word": "Redundant",
            "meaning": "unnecessary because it is more than is needed; superfluous",
            "example": "In the sentence \"She is a single unmarried woman\", the word \"unmarried\" is redundant."
        },
        {
            "id": "24",
            "word": "Hackneyed",
            "meaning": "Unoriginal; Trite; Tedious and uninspiring",
            "example": "The plot of the film is just a hackneyed boy-meets-girl scenario."
        },
        {
            "id": "25",
            "word": "Prudent",
            "meaning": "careful and avoiding risks; showing care and thought",
            "example": "It's always prudent to read a contract carefully before signing it."
        },
        {
            "id": "26",
            "word": "Belie",
            "meaning": "to show something to be false, or to hide something such as an emotion.",
            "example": "Her calm face belied the terror she was feeling."
        },
        {
            "id": "27",
            "word": "Esoteric",
            "meaning": "intended for or understood by only a few people who have special knowledge; obscure",
            "example": "Literary readings can sometimes seem esoteric, but we are trying to make them more attractive to more people."
        },
        {
            "id": "28",
            "word": "Cacophony",
            "meaning": "an unpleasant mixture of loud sounds",
            "example": "The cacophony surrounding the multi-billion dollar buyout of leading messaging service by a social networking company shook the whole tech industry."
        },
        {
            "id": "29",
            "word": "Impetuous",
            "meaning": "likely to do something suddenly, without considering the results of your actions",
            "example": "He's so impetuous - why can't he think things over before he rushes into them?"
        },
        {
            "id": "30",
            "word": "Idiosyncrasy",
            "meaning": "a strange or unusual habit, way of behaving, or feature",
            "example": "One of the idiosyncrasies of this printer is that you can't stop it once it has started."
        },
        {
            "id": "31",
            "word": "Extant",
            "meaning": "used to refer to something very old that is still existing",
            "example": "Phyllis Wheatley is the author of the earliest extant volume of poetry by an African American."
        },
        {
            "id": "32",
            "word": "Obscure",
            "meaning": "not clear and difficult to understand or see; not known to many people",
            "example": "Official policy has changed, for reasons that remain obscure."
        },
        {
            "id": "33",
            "word": "Didactic",
            "meaning": "intended to teach, especially in a way that is too determined or eager, and often fixed and unwilling to change",
            "example": "Children’s books possess a practical, didactic purpose – to instill a love for reading."
        },
        {
            "id": "34",
            "word": "Pithy",
            "meaning": "brief; to the point;  expressing an idea cleverly in a few words.",
            "example": "He was considered a superb and pithy writer."
        },
        {
            "id": "35",
            "word": "Copious",
            "meaning": "in large amounts, or more than enough",
            "example": "He took copious notes during the lecture."
        },
        {
            "id": "36",
            "word": "Ostentation",
            "meaning": "a vulgar show of wealth, possessions, or power intended to attract admiration or notice; show-off",
            "example": "Her luxurious lifestyle and personal ostentation were both hated and envied."
        },
        {
            "id": "37",
            "word": "Adulterate",
            "meaning": "alter or debase often for profit; to make something weaker or of worse quality by adding something else to it",
            "example": "Saffron is very expensive, and is often adulterated with other plants."
        },
        {
            "id": "38",
            "word": "Vociferous",
            "meaning": "loud and clamorous",
            "example": "Local activist groups have become increasingly vociferous as the volume of traffic passing through the village has increased."
        },
        {
            "id": "39",
            "word": "Taciturn",
            "meaning": "tending not to speak much; reserved; uncommunicative in speech",
            "example": "He was always quiet, reserved, and taciturn."
        },
        {
            "id": "40",
            "word": "Obdurate",
            "meaning": "extremely determined to act in a particular way and not to change despite what anyone else says; stubborn",
            "example": "Union leaders remain obdurate that working conditions and pay improve."
        },
        {
            "id": "41",
            "word": "Garrulous",
            "meaning": "excessively talkative; having the habit of talking a lot, especially about things that are not important",
            "example": "I had talked too much about myself and felt like a garrulous old fool."
        },
        {
            "id": "42",
            "word": "Misanthrope",
            "meaning": "someone who dislikes or hates and avoids other people",
            "example": "He is a hard-cursing, chain-smoking misanthrope who formerly worked on a children's television programme."
        },
        {
            "id": "43",
            "word": "Lionize",
            "meaning": "to make someone famous, or to treat someone as if they were famous",
            "example": "During her reign he was much lionized as a military hero of incredible valor."
        },
        {
            "id": "44",
            "word": "Imminent",
            "meaning": "about to happen",
            "example": "He gave a dire warning that an earthquake was imminent."
        },
        {
            "id": "45",
            "word": "Deride",
            "meaning": "to laugh at someone or something in a way that shows you think they are stupid or of no value; insult",
            "example": "This building, once derided by critics, is now a major tourist attraction."
        },
        {
            "id": "46",
            "word": "Lethargic",
            "meaning": "lazy; sluggish;  feeling unwilling and unable to do anything",
            "example": "He was found to be pale, thin, wasted and lethargic, with slow and confused answers, according to the hospital's discharge summary."
        },
        {
            "id": "47",
            "word": "Inchoate",
            "meaning": "only recently or partly formed, or not completely developed or clear; undeveloped;",
            "example": "He is easily intimidated when the left condemns this vague, inchoate mixture of family loyalty and patriotism as the bigotry of the extreme right."
        },
        {
            "id": "48",
            "word": "Profound",
            "meaning": "felt or experienced very strongly or in an extreme way; thoughtful",
            "example": "The invention of the contraceptive pill brought about profound changes in the lives of women."
        },
        {
            "id": "49",
            "word": "Pedant",
            "meaning": "a person who is too interested in formal rules and small details that are not important",
            "example": "Harrison is a pedant who would rather waste his time bickering than letting trivial things go."
        },
        {
            "id": "50",
            "word": "Euphoric",
            "meaning": "extreme happiness, sometimes more than is reasonable in a particular situation",
            "example": "The cricket team players where euphoric after their world cup victory."
        },
        {
            "id": "51",
            "word": "Enigma",
            "meaning": "something that is mysterious and seems impossible or difficult to understand completely",
            "example": "The newspapers were full of stories about the enigma of the plane's disappearance."
        },
        {
            "id": "52",
            "word": "Ambivalent",
            "meaning": "having two opposing feelings at the same time, or being uncertain about how you feel; conflicting",
            "example": "I felt very ambivalent about leaving home."
        },
        {
            "id": "53",
            "word": "Vacillate",
            "meaning": "to be uncertain what to do, or to change often between two opinions; be indecisive",
            "example": "Her mood vacillated between hope and despair."
        },
        {
            "id": "54",
            "word": "Pusillanimous",
            "meaning": "​weak and cowardly (= not brave); frightened of taking risks; fearful;",
            "example": "He's too pusillanimous to stand up to his opponents."
        },
        {
            "id": "55",
            "word": "Ephemeral",
            "meaning": "​lasting for only a short time; momentary; passing",
            "example": "Fame in the world of rock and pop is largely ephemeral."
        },
        {
            "id": "56",
            "word": "Recalcitrant",
            "meaning": "​(of a person) unwilling to obey orders or to do what should be done, or (of an animal) refusing to be controlled",
            "example": "Tenants petitioned their recalcitrant landlord to finish repairs to their building."
        },
        {
            "id": "57",
            "word": "Fastidious",
            "meaning": "​giving too much attention to small details and wanting everything to be correct and perfect;​",
            "having": {},
            "example": "He is very fastidious about how a suitcase should be packed."
        },
        {
            "id": "58",
            "word": "Superfluous",
            "meaning": "​ more than is needed or wanted; unnecessary",
            "having": {},
            "example": "The report was marred by a mass of superfluous detail."
        },
        {
            "id": "59",
            "word": "Inimical",
            "meaning": "​harmful; limiting",
            "example": "Excessive managerial control is inimical to creative expression."
        },
        {
            "id": "60",
            "word": "Equivocate",
            "meaning": "​to speak in a way that is intentionally not clear and confusing to other people, especially to hide the truth",
            "example": "She accused the minister of equivocating, claiming that he had deliberately avoided telling the public how bad the problem really was."
        },
        {
            "id": "61",
            "word": "Loquacious",
            "meaning": "​someone who tends to talk a lot; talkative",
            "example": "I was talking, as one always does, to a loquacious taxi driver."
        },
        {
            "id": "62",
            "word": "Engender",
            "meaning": "​​to make people have a particular feeling or make a situation start to exist; cause or give rise to",
            "example": "The vice-president's speech did not engender confidence in his judgment."
        },
        {
            "id": "63",
            "word": "Soporific",
            "meaning": "​​​causing sleep or making a person want to sleep; causing drowsiness",
            "example": "Soon thereafter, however, he found the world of academia restrictive and soporific."
        },
        {
            "id": "64",
            "word": "Auspicious",
            "meaning": "​​​​suggesting a positive and successful future",
            "example": "Winning her first seven cases was an auspicious beginning for the young lawyer."
        },
        {
            "id": "65",
            "word": "Prodigal",
            "meaning": "tending to spend or use something without thinking of the future; wastefully extravagant",
            "example": "There have been rumours that he has been prodigal with company funds."
        },
        {
            "id": "66",
            "word": "Enervate",
            "meaning": "​to make someone feel weak and without energy; wear out",
            "example": "Even educational establishments are suspect on the ground—not unnatural after his own experience of Oxford—that their possibilities of comfort may enervate the natural energies of men."
        },
        {
            "id": "67",
            "word": "Fervid",
            "meaning": "passionate; intensely enthusiastic",
            "example": "They hurled fervid accusations at each other during the debate."
        },
        {
            "id": "68",
            "word": "Reticent",
            "meaning": "secretive; unwilling to speak about your thoughts or feelings",
            "example": "He is very reticent about his past."
        },
        {
            "id": "69",
            "word": "Tumultuous",
            "meaning": "confused; disorderly;",
            "example": "The crowd at the concert was tumultuous, and went berserk."
        },
        {
            "id": "70",
            "word": "Audacious",
            "meaning": "showing a willingness to take risks or offend people; reckless; daring",
            "example": "The car maker's audacious goal is to compete with the luxury cars of other manufacturers."
        },
        {
            "id": "71",
            "word": "Innocuous",
            "meaning": "completely harmless (= causing no harm); inoffensive",
            "example": "Some mushrooms look innocuous but are in fact poisonous."
        },
        {
            "id": "72",
            "word": "Advocate",
            "meaning": "to publicly support or suggest an idea, development, or way of doing something",
            "example": "She advocates taking a more long-term view."
        },
        {
            "id": "73",
            "word": "Trivial",
            "meaning": "having little value or importance;",
            "example": "I don't know why he gets so upset about something so trivial."
        },
        {
            "id": "74",
            "word": "Anachronism",
            "meaning": "a person, thing, or idea that exists out of its time in history, especially one that happened or existed later than the period being shown, discussed, etc.",
            "example": "For some people, marriage is an anachronism from the days when women needed to be protected"
        },
        {
            "id": "75",
            "word": "Bolster",
            "meaning": "to support or improve something or make it stronger; strengthen",
            "example": "More money is needed to bolster the industry."
        },
        {
            "id": "76",
            "word": "Erudite",
            "meaning": "having or containing a lot of knowledge that is known by very few people; well educated; cultured",
            "example": "He's the author of an erudite book on Scottish history."
        },
        {
            "id": "77",
            "word": "Meticulous",
            "meaning": "very careful and with great attention to every detail",
            "example": "Many hours of meticulous preparation have gone into writing the book."
        },
        {
            "id": "78",
            "word": "Ingenious",
            "meaning": "very intelligent and skilful, or skilfully made or planned and involving new ideas and methods; original; inventive",
            "example": "Johnny is so ingenious - he can make the most remarkable sculptures from the most ordinary materials."
        },
        {
            "id": "79",
            "word": "Succinct",
            "meaning": "said in a clear and short way; expressing what needs to be said without unnecessary words",
            "example": "Keep your letter succinct and to the point."
        },
        {
            "id": "80",
            "word": "Trite",
            "meaning": "expressed too often to be interesting or seem sincere; silly; commonplace",
            "example": "I know it will sound trite, but I've loved being part of this club."
        },
        {
            "id": "81",
            "word": "Venerate",
            "meaning": "to honour or very much respect a person or thing",
            "example": "Many families had a special saint they used to venerate."
        },
        {
            "id": "82",
            "word": "Sanguine",
            "meaning": "positive and hoping for good things; optimistic; red",
            "example": "They are less sanguine about the prospects for peace."
        },
        {
            "id": "83",
            "word": "Plausible",
            "meaning": "seeming likely to be true, or able to be believed",
            "example": "a plausible explanation/excuse"
        },
        {
            "id": "84",
            "word": "Disparate",
            "meaning": "​different in every way",
            "example": "The two cultures were so utterly disparate that she found it hard to adapt from one to the other."
        },
        {
            "id": "85",
            "word": "Malign",
            "meaning": "​causing or intending to cause harm or evil; evil itself",
            "example": "Foreign domination had a malign influence on local politics."
        },
        {
            "id": "86",
            "word": "Fractious",
            "meaning": "tending to argue, fight, or complain, and hard to control; quarrelsome; irritable",
            "example": "The fractious nature of politics"
        },
        {
            "id": "87",
            "word": "Diffidence",
            "meaning": "the quality of being shy and not confident of your abilities; hesistance",
            "example": "He spoke with a certain diffidence which added to his charm"
        },
        {
            "id": "88",
            "word": "Providential",
            "meaning": "happening exactly when needed but without being planned;",
            "example": "Therefore, it is providential that this vast and powerful new form of energy has arrived just at this moment."
        },
        {
            "id": "89",
            "word": "Dispassionate",
            "meaning": "able to think clearly or make good decisions because of not being influenced by emotions; unfeeling",
            "example": "In all the media hysteria, there was one journalist whose comments were clear-sighted and dispassionate."
        },
        {
            "id": "90",
            "word": "Belligerent",
            "meaning": "hostile; aggressive;",
            "example": "The belligerent countries are having difficulties funding the war."
        },
        {
            "id": "91",
            "word": "Eulogy",
            "meaning": "a speech, piece of writing, poem, etc. containing great praise, especially for someone who recently died or retired from work",
            "example": "The song was a eulogy to the joys of travelling."
        },
        {
            "id": "92",
            "word": "​Gainsay",
            "meaning": "to refuse to accept something as the truth; deny; contradict",
            "example": "Certainly there's no gainsaying (= it is not possible to doubt) the technical brilliance of his performance."
        },
        {
            "id": "93",
            "word": "​Chicanery",
            "meaning": "clever, dishonest talk or behaviour that is used to deceive people; deception; trickery",
            "example": "The investigation revealed political chicanery and corruption at the highest levels."
        },
        {
            "id": "94",
            "word": "​Prevaricate",
            "meaning": "to avoid telling the truth or saying exactly what you think; deceive; stretch the truth",
            "example": "Aron does not take bad news well and hence her brother always prevaricates when telling her something she does not want to hear."
        },
        {
            "id": "95",
            "word": "​Sporadic",
            "meaning": "happening sometimes; not regular or continuous; scattered or isolated",
            "example": "The gunfire was sporadic."
        },
        {
            "id": "96",
            "word": "​Docile",
            "meaning": "quiet and easy to influence, persuade, or control; submissive; compliant",
            "example": "The once docile population has finally risen up against the ruthless regime."
        },
        {
            "id": "97",
            "word": "​Inculpate",
            "meaning": "accuse or blame",
            "example": "he blamed himself, but also inculpated his fiancée"
        },
        {
            "id": "98",
            "word": "​Dissonance",
            "meaning": "disagreement;  a combination of sounds or musical notes that are not pleasant when heard together",
            "example": "Historical interpretations exist in groups, and sometimes support each other for reasons of social function despite apparent methodological dissonances."
        },
        {
            "id": "99",
            "word": "​Benign",
            "meaning": "pleasant and kind; gentle",
            "example": "His humour was benign, never cruel or hurtful."
        },
        {
            "id": "100",
            "word": "​Frivolous",
            "meaning": "behaving in a silly way and not taking anything seriously",
            "example": "With our justice system there are a lot of frivolous cases that go to court."
        },
        {
            "id": "101",
            "word": "​Conspicious",
            "meaning": "very noticeable or attracting attention, often in a way that is not wanted; obvious",
            "example": "He tried not to look conspicuous and moved slowly along the back of the room."
        },
        {
            "id": "102",
            "word": "Antiquated",
            "meaning": "old-fashioned or outdated.",
            "example": "Compared with modern satellite dishes, ordinary TV aerials look positively antiquated."
        },
        {
            "id": "103",
            "word": "Cornucopia",
            "meaning": "a large amount or supply of something; abundant supply",
            "example": "Compared with modern satellite dishes, ordinary TV aerials look positively antiquated."
        },
        {
            "id": "104",
            "word": "Cardinal",
            "meaning": "of great importance",
            "example": "He did, however, start off with the right credentials to become a major playwright: he considered disrespect for authority a cardinal virtue."
        },
        {
            "id": "105",
            "word": "Vitriol",
            "meaning": "violent hate and anger expressed through severe criticism; abusive language",
            "example": "His tendency toward insult and vitriol offended most critics, who called him outrageous, belligerent, and self-righteous."
        },
        {
            "id": "106",
            "word": "Primacy",
            "meaning": "the state of being the most important thing",
            "example": "The government insists on the primacy of citizens' rights."
        },
        {
            "id": "107",
            "word": "Imbibe",
            "meaning": "to receive and accept information, etc.; absorb ideas; to drink",
            "example": "They were men who had imbibed the psychology of colonial subordination."
        },
        {
            "id": "108",
            "word": "Pith",
            "meaning": "most essential part; essence; the spongy white tissue lining the rind of oranges, lemons, and other citrus fruits.",
            "example": "the pith and core of socialism."
        },
        {
            "id": "109",
            "word": "Veritable",
            "meaning": "used to describe something as another, more exciting, interesting, or unusual thing, as a way of emphasizing its character; without a doubt",
            "example": "My garden had become a veritable jungle by the time I came back from holiday."
        },
        {
            "id": "110",
            "word": "Spartan",
            "meaning": "simple and severe with no comfort",
            "example": "They lead a spartan life, with very few comforts and no luxuries."
        },
        {
            "id": "111",
            "word": "Steadfast",
            "meaning": "staying the same for a long time and not changing quickly or unexpectedly; unwaivering",
            "example": "The group remained steadfast in its support for the new system, even when it was criticized in the newspapers."
        },
        {
            "id": "112",
            "word": "Duplicity",
            "meaning": "dishonest talk or behaviour, especially by saying different things to two people",
            "example": "They were accused of duplicity in their dealings with both sides."
        },
        {
            "id": "113",
            "word": "Unassailable",
            "meaning": "in such a strong position that you cannot be defeated; immune to attack",
            "example": "The president looked unassailable with over 60 percent of the vote."
        },
        {
            "id": "114",
            "word": "Banality",
            "meaning": "boring, ordinary; cliché",
            "example": "He just sat there making banal remarks all evening."
        },
        {
            "id": "115",
            "word": "Apathy",
            "meaning": "lack of interest, or the attitude of not caring resulting from it",
            "example": "There is a growing sense of apathy among teens and a feeling that there are no opportunities, he said."
        },
        {
            "id": "116",
            "word": "Debonair",
            "meaning": "(especially of men) attractive, confident, and carefully dressed",
            "example": "He is duped by a debonair con man into opening a car and safe, and lands in jail for a year."
        },
        {
            "id": "117",
            "word": "conducive",
            "meaning": "making a certain situation or outcome likely or possible.",
            "example": "the harsh lights and cameras were hardly conducive to a relaxed atmosphere"
        },
        {
            "id": "118",
            "word": "Pedagogy",
            "meaning": "the method and practice of teaching, especially as an academic subject or theoretical concept.",
            "example": "Professors aim to get tenure at the expense of pedagogy."
        },
        {
            "id": "119",
            "word": "Strictures",
            "meaning": "abnormal narrowing of a bodily canal or passageway; severe criticism",
            "example": "\"the strictures imposed by the British Board of Film Censors."
        },
        {
            "id": "120",
            "word": "Verisimilitude",
            "meaning": "the appearance of being true or real.",
            "example": "The detail gives the novel some verisimilitude."
        },
        {
            "id": "121",
            "word": "Subvert",
            "meaning": "to try to destroy or damage something",
            "example": "The rebel army is attempting to subvert the government."
        },
        {
            "id": "122",
            "word": "Retroactively",
            "meaning": "(of a law or decision) in a way that affects a date before it was approved",
            "example": "The courts cannot apply a new rule retroactively"
        },
        {
            "id": "123",
            "word": "Spasmodically",
            "meaning": "Irregularly; happens suddenly in short bursts.",
            "example": "He made spasmodic attempts to clean up the house."
        },
        {
            "id": "124",
            "word": "Incessant",
            "meaning": "never stopping, especially annoyingly or unpleasantly:",
            "example": "It was raining incessantly"
        },
        {
            "id": "125",
            "word": "Spurious",
            "meaning": "false and not what it appears to be, or (of reasons and judgments) based on something that has not been correctly understood and therefore false",
            "example": "Some of the arguments in favour of shutting the factory are questionable and others downright spurious."
        },
        {
            "id": "126",
            "word": "Intransigent",
            "meaning": "refusing to change your opinions or behaviour",
            "example": "Unions claim that the management continues to maintain an intransigent position"
        },
        {
            "id": "127",
            "word": "Stolid",
            "meaning": "calm and not showing emotion or excitement; not interesting or attractive",
            "example": "He's a very stolid, serious man"
        },
        {
            "id": "128",
            "word": "Debonair",
            "meaning": "(especially of men) attractive, confident, and carefully dressed",
            "example": "Abhinav is a debonair young man ;)"
        },
        {
            "id": "129",
            "word": "Stultified",
            "meaning": "preventing new ideas from developing; limited in growth",
            "example": "These countries are trying to shake off the stultifying effects of several decades of state control."
        },
        {
            "id": "130",
            "word": "Eschew",
            "meaning": "To avoid something intentionally, or to give something up",
            "example": "We won't have discussions with this group unless they eschew violence."
        },
        {
            "id": "131",
            "word": "Languish",
            "meaning": "To exist in an unpleasant or unwanted situation, often for a long time.",
            "example": "The ruling party is languishing in third place in the opinion polls."
        },
        {
            "id": "132",
            "word": "Intelligentsia",
            "meaning": "Very educated people in a society, especially those interested in the arts and in politics",
            "example": "He went on to join the intelligentsia."
        },
        {
            "id": "133",
            "word": "Brazen",
            "meaning": "obvious, without any attempt to be hidden",
            "example": "He told me a brazen lie."
        },
        {
            "id": "134",
            "word": "Stratification",
            "meaning": "the fact that the different parts of something exist in or have been arranged into separate groups",
            "example": "The prime minister wants to reduce social stratification and make the country a classless societ"
        },
        {
            "id": "135",
            "word": "Craven",
            "meaning": "Extremely cowardly; not brave",
            "example": "The heckler acted cravenly after being identified."
        },
        {
            "id": "136",
            "word": "Insolvent",
            "meaning": "(especially of a company) not having enough money to pay debts, buy goods, etc.",
            "example": "The firm was about to become insolvent, by the time the new CEO stepped in."
        },
        {
            "id": "137",
            "word": "Decadent",
            "meaning": "A group or person having low moral standards",
            "example": "It was a decadent monarchy."
        },
        {
            "id": "138",
            "word": "Cloistered",
            "meaning": "separated from and communicating little with the outside world",
            "example": "These academics led a cloistered life."
        },
        {
            "id": "139",
            "word": "Austere",
            "meaning": "very simple and without comfort or unnecessary things, especially because of severe limits on money or goods; unfriendly",
            "example": "He had an austere childhood during war."
        },
        {
            "id": "140",
            "word": "Salvation",
            "meaning": "(a way of) being saved from danger, loss, or harm",
            "example": "Scoring 330+ was his salvation"
        },
        {
            "id": "141",
            "word": "Asceticism",
            "meaning": "avoiding physical pleasures and living a simple life, often for religious reasons",
            "example": "Monks live an ascetic life."
        },
        {
            "id": "142",
            "word": "Benighted",
            "meaning": "without knowledge or morals",
            "example": "Some of the early explorers thought of the local people as benighted savages who could be exploited."
        },
        {
            "id": "143",
            "word": "Beatify",
            "meaning": "to describe or think of someone as if they are extremely good and have no faults; the pope declares someone's life as holy",
            "example": "He beatifies his first wife while celebrating his own extra-marital affairs."
        },
        {
            "id": "144",
            "word": "Munificent",
            "meaning": "Very generous",
            "example": "The new PM was anything but munificent."
        },
        {
            "id": "145",
            "word": "Prescriptive",
            "meaning": "saying exactly what must happen, especially by giving an instruction or making a rule.",
            "example": "Most teachers think the government's guidelines on homework are too prescriptive."
        },
        {
            "id": "146",
            "word": "Abstruse",
            "meaning": "not known or understood by many people.",
            "example": "An abstruse philosophical essay."
        },
        {
            "id": "147",
            "word": "Operatic",
            "meaning": "extravagantly theatrical; relating to opera",
            "example": "she wrung her hands in operatic despair"
        },
        {
            "id": "148",
            "word": "Countermand",
            "meaning": "to change an order that has already been given, especially by giving a new order",
            "example": "As your superior, I countermanded that will!"
        },
        {
            "id": "149",
            "word": "Sycophantic",
            "meaning": "(of a person or behavior) praising people in authority in a way that is not sincere, usually, to get some advantage from them.",
            "example": "There was sycophantic laughter from the audience at every one of his terrible jokes."
        },
        {
            "id": "150",
            "word": "Aesthete",
            "meaning": "a person who understands and enjoys beauty; appreciates art",
            "example": "The ugliness of the city would make an aesthete like you shudder."
        },
        {
            "id": "151",
            "word": "Inquisitor",
            "meaning": "a person making an inquiry, especially one seen to be excessively harsh or searching.",
            "example": "The professional inquisitors of the press"
        },
        {
            "id": "152",
            "word": "Philistine",
            "meaning": "a person who refuses to see the beauty or the value of art or culture:",
            "example": "I wouldn't have expected them to enjoy a film of that quality anyway - they're just a bunch of philistines!"
        },
        {
            "id": "153",
            "word": "Plodding",
            "meaning": "to walk taking slow steps, as if your feet are heavy; boring, sleep inducing",
            "example": "For years, he's plodded away at the same dull routine job."
        },
        {
            "id": "154",
            "word": "Extol",
            "meaning": "to praise something or someone very much",
            "example": "She is forever extolling the virtues of her children."
        },
        {
            "id": "155",
            "word": "Drivel",
            "meaning": "nonsense or boring and unnecessary information:",
            "example": "You don't believe the drivel you read on the internet, do you?"
        },
        {
            "id": "156",
            "word": "Persnickety",
            "meaning": "giving too much attention to small details that are not important in a way that annoys other people.",
            "example": "Meticulous to a fault, Sarah is often considered persnickety."
        },
        {
            "id": "157",
            "word": "Wayward",
            "meaning": "doing only what you want and often changing your behaviour in a way that is difficult to control",
            "example": "If you keep acting like that, they will think of you as wayward."
        },
        {
            "id": "158",
            "word": "Precocious",
            "meaning": "(especially of children) showing mental development or achievement much earlier than usual.",
            "example": "She recorded her first CD at the precocious age of twelve."
        },
        {
            "id": "159",
            "word": "Obstinate",
            "meaning": "unreasonably determined, especially to act in a particular way and not to change at all, despite what anyone else says",
            "example": "her obstinate refusal to compromise"
        },
        {
            "id": "160",
            "word": "Consummate",
            "meaning": "perfect, or complete in every way",
            "example": "He's a consummate athlete/gentleman/liar."
        },
        {
            "id": "161",
            "word": "Trounce",
            "meaning": "To defeat a competitor by a large margin",
            "example": "France trounced Germany by five goals to one in the qualifying match."
        },
        {
            "id": "162",
            "word": "Pillory",
            "meaning": "to severely criticize someone, especially in a public way",
            "example": "Although regularly pilloried by the press as an obnoxious loudmouth, he is, nonetheless, an effective politician."
        },
        {
            "id": "163",
            "word": "Lampoon",
            "meaning": "a piece of writing, a drawing, etc. that criticizes a famous person or a public organization in a humorous way, allowing their or its bad qualities to be seen and making them or it seem stupid",
            "example": "The magazine is famed for its merciless political lampoons."
        },
        {
            "id": "164",
            "word": "Temerity",
            "meaning": "a willingness to do or say something that shocks or upsets other people",
            "example": "She had the temerity to call me a liar."
        },
        {
            "id": "165",
            "word": "Epigram",
            "meaning": "a short saying or poem that expresses an idea in an amusing way",
            "example": "One of Oscar Wilde's most frequently quoted epigrams is \"I can resist everything except temptation\"."
        },
        {
            "id": "166",
            "word": "Apothegm",
            "meaning": "a short clever saying that is intended to express a general truth",
            "example": "We are all familiar with Tolstoy's apothegm: \"Happy families are all alike; every unhappy family is unhappy in its own way.\""
        },
        {
            "id": "167",
            "word": "Punctilious",
            "meaning": "very careful to behave correctly or to give attention to details",
            "example": "He was always punctilious in his manners."
        }
    ]
}
// précis admonitory egregious solipsism rebuke nadir precosity apogee aphoristic paucity smattering intractable staid gregarious inveterate impervious palatable empiricism ornate diminutive implicate impede apathy doleful perennial
// aberrant  taxing  squelch artlessness elusive  coalesce attenuate  credulity inimitable preempt estimable tirade flippant assiduously creditable heyday
// profusion squelch contemptuous panacea aphorismm  reverent languish
// elicit  cataclysm elude assiduously venality harangue chortle incisive